cases/wallFireSpread2D/constant/panelRegion/reactions
species
(
    //wood
    v
    char
);

gaseousSpecies
(
    gas
);

reactions
{
    charReaction
    {
        type        irreversibleArrheniusSolidReaction;
        //reaction    "wood^4.86 = char + gas";
        reaction    "v^4.86 = char + gas";
        A           7.83e10;
        Ta          15274.57;
        Tcrit       400;
    }
}

